In [4]:
# initial imports
import pandas as pd
import calendar
import plotly.express as px
import hvplot.pandas
from sqlalchemy import create_engine

In [5]:
# create a connection to the database
engine = create_engine("postgresql://postgres:postgres@localhost:5432/fraud_detection")

In [14]:
# We have written SQL Queries (refer to queries.sql) and created a view for Q1-Q3, 
# we are pulling the below data from the view for demonstration of the result only

# Q1: How can you isolate (or group) the transactions of each cardholder?
query = "SELECT * from transactions_bunched_by_card_holder"
transaction_df = pd.read_sql(query, engine)
transaction_df.head()

In [31]:
# We have written SQL Queries (refer to queries.sql) and created a view for Q1-Q3, 
# we are pulling the below data from the view for demonstration of the result only

# Q2: Consider the time period 7:00 a.m. to 9:00 a.m.
query= "SELECT * from  transactions_below_2dollar"
transaction_below2_df = pd.read_sql(query, engine)
transaction_below2_df.head()

   card_holder_id card_holder_name          credit_card  count
0              22   Austin Johnson         501809222273      7
1               6   Beth Hernandez     3581345943543942      2
2               6   Beth Hernandez  4159836738768855913      4
3              11   Brandon Pineda      180098539019105     11
4              11   Brandon Pineda     4027907156459098      5

In [54]:
# We have written SQL Queries (refer to queries.sql) and created a view for Q1-Q3, 
# we are pulling the below data from the view for demonstration of the result only

# Q3: What are the 100 highest transactions during this time period?

pd.options.display.float_format = '${:,.13f}'.format #Need to format the display to show the suspecious anomaly
query = "SELECT * from top_100_highest_transactions"
top_100_transactions = pd.read_sql(query, engine)
top_100_transactions.head()

,trans_id,date,amount,credit_card,merch_id
0,3163,2018-12-07 07:22:03,"$1,894.0000000000002",4761049645711555811,9
1,2451,2018-03-05 08:26:08,"$1,617.0000000000002",5570600642865857,4
2,2840,2018-03-06 07:18:09,"$1,334.0000000000000",4319653513507,87
3,1442,2018-01-22 08:07:03,"$1,131.0000000000000",5570600642865857,144
4,968,2018-09-26 08:48:40,"$1,060.0000000000000",4761049645711555811,134

##### `Q:` Do you see any fraudulent or anomalous transactions? If you answered yes, explain why you think there might be fraudulent transactions during this time frame.
##### `A:` Yes, Top 2 amounts look very suspecious. All money is a decimal value with two places. However, the two transactions which pop out are the ones with decimal value with 13 places!!! Also they look unusually large compared to the rest of the data set